RT-Thread/rt-thread/bsp/freescale/platform/devices/MK51D10/include/MK51D10.h
#define LCD_WF8B_BPGLCD18_MASK                   0x40u
#define LCD_WF8B_BPGLCD18_SHIFT                  6
#define LCD_WF8B_BPGLCD18_WIDTH                  1
#define LCD_WF8B_BPGLCD18(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD18_SHIFT))&LCD_WF8B_BPGLCD18_MASK)
#define LCD_WF8B_BPGLCD19_MASK                   0x40u
#define LCD_WF8B_BPGLCD19_SHIFT                  6
#define LCD_WF8B_BPGLCD19_WIDTH                  1
#define LCD_WF8B_BPGLCD19(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD19_SHIFT))&LCD_WF8B_BPGLCD19_MASK)
#define LCD_WF8B_BPGLCD8_MASK                    0x40u
#define LCD_WF8B_BPGLCD8_SHIFT                   6
#define LCD_WF8B_BPGLCD8_WIDTH                   1
#define LCD_WF8B_BPGLCD8(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD8_SHIFT))&LCD_WF8B_BPGLCD8_MASK)
#define LCD_WF8B_BPGLCD49_MASK                   0x40u
#define LCD_WF8B_BPGLCD49_SHIFT                  6
#define LCD_WF8B_BPGLCD49_WIDTH                  1
#define LCD_WF8B_BPGLCD49(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD49_SHIFT))&LCD_WF8B_BPGLCD49_MASK)
#define LCD_WF8B_BPGLCD20_MASK                   0x40u
#define LCD_WF8B_BPGLCD20_SHIFT                  6
#define LCD_WF8B_BPGLCD20_WIDTH                  1
#define LCD_WF8B_BPGLCD20(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD20_SHIFT))&LCD_WF8B_BPGLCD20_MASK)
#define LCD_WF8B_BPGLCD9_MASK                    0x40u
#define LCD_WF8B_BPGLCD9_SHIFT                   6
#define LCD_WF8B_BPGLCD9_WIDTH                   1
#define LCD_WF8B_BPGLCD9(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD9_SHIFT))&LCD_WF8B_BPGLCD9_MASK)
#define LCD_WF8B_BPGLCD21_MASK                   0x40u
#define LCD_WF8B_BPGLCD21_SHIFT                  6
#define LCD_WF8B_BPGLCD21_WIDTH                  1
#define LCD_WF8B_BPGLCD21(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD21_SHIFT))&LCD_WF8B_BPGLCD21_MASK)
#define LCD_WF8B_BPGLCD13_MASK                   0x40u
#define LCD_WF8B_BPGLCD13_SHIFT                  6
#define LCD_WF8B_BPGLCD13_WIDTH                  1
#define LCD_WF8B_BPGLCD13(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD13_SHIFT))&LCD_WF8B_BPGLCD13_MASK)
#define LCD_WF8B_BPGLCD48_MASK                   0x40u
#define LCD_WF8B_BPGLCD48_SHIFT                  6
#define LCD_WF8B_BPGLCD48_WIDTH                  1
#define LCD_WF8B_BPGLCD48(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD48_SHIFT))&LCD_WF8B_BPGLCD48_MASK)
#define LCD_WF8B_BPGLCD22_MASK                   0x40u
#define LCD_WF8B_BPGLCD22_SHIFT                  6
#define LCD_WF8B_BPGLCD22_WIDTH                  1
#define LCD_WF8B_BPGLCD22(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD22_SHIFT))&LCD_WF8B_BPGLCD22_MASK)
#define LCD_WF8B_BPGLCD5_MASK                    0x40u
#define LCD_WF8B_BPGLCD5_SHIFT                   6
#define LCD_WF8B_BPGLCD5_WIDTH                   1
#define LCD_WF8B_BPGLCD5(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD5_SHIFT))&LCD_WF8B_BPGLCD5_MASK)
#define LCD_WF8B_BPGLCD47_MASK                   0x40u
#define LCD_WF8B_BPGLCD47_SHIFT                  6
#define LCD_WF8B_BPGLCD47_WIDTH                  1
#define LCD_WF8B_BPGLCD47(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD47_SHIFT))&LCD_WF8B_BPGLCD47_MASK)
#define LCD_WF8B_BPGLCD23_MASK                   0x40u
#define LCD_WF8B_BPGLCD23_SHIFT                  6
#define LCD_WF8B_BPGLCD23_WIDTH                  1
#define LCD_WF8B_BPGLCD23(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD23_SHIFT))&LCD_WF8B_BPGLCD23_MASK)
#define LCD_WF8B_BPGLCD24_MASK                   0x40u
#define LCD_WF8B_BPGLCD24_SHIFT                  6
#define LCD_WF8B_BPGLCD24_WIDTH                  1
#define LCD_WF8B_BPGLCD24(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD24_SHIFT))&LCD_WF8B_BPGLCD24_MASK)
#define LCD_WF8B_BPGLCD25_MASK                   0x40u
#define LCD_WF8B_BPGLCD25_SHIFT                  6
#define LCD_WF8B_BPGLCD25_WIDTH                  1
#define LCD_WF8B_BPGLCD25(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD25_SHIFT))&LCD_WF8B_BPGLCD25_MASK)
#define LCD_WF8B_BPGLCD46_MASK                   0x40u
#define LCD_WF8B_BPGLCD46_SHIFT                  6
#define LCD_WF8B_BPGLCD46_WIDTH                  1
#define LCD_WF8B_BPGLCD46(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD46_SHIFT))&LCD_WF8B_BPGLCD46_MASK)
#define LCD_WF8B_BPGLCD26_MASK                   0x40u
#define LCD_WF8B_BPGLCD26_SHIFT                  6
#define LCD_WF8B_BPGLCD26_WIDTH                  1
#define LCD_WF8B_BPGLCD26(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD26_SHIFT))&LCD_WF8B_BPGLCD26_MASK)
#define LCD_WF8B_BPGLCD27_MASK                   0x40u
#define LCD_WF8B_BPGLCD27_SHIFT                  6
#define LCD_WF8B_BPGLCD27_WIDTH                  1
#define LCD_WF8B_BPGLCD27(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD27_SHIFT))&LCD_WF8B_BPGLCD27_MASK)
#define LCD_WF8B_BPGLCD10_MASK                   0x40u
#define LCD_WF8B_BPGLCD10_SHIFT                  6
#define LCD_WF8B_BPGLCD10_WIDTH                  1
#define LCD_WF8B_BPGLCD10(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD10_SHIFT))&LCD_WF8B_BPGLCD10_MASK)
#define LCD_WF8B_BPGLCD45_MASK                   0x40u
#define LCD_WF8B_BPGLCD45_SHIFT                  6
#define LCD_WF8B_BPGLCD45_WIDTH                  1
#define LCD_WF8B_BPGLCD45(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD45_SHIFT))&LCD_WF8B_BPGLCD45_MASK)
#define LCD_WF8B_BPGLCD28_MASK                   0x40u
#define LCD_WF8B_BPGLCD28_SHIFT                  6
#define LCD_WF8B_BPGLCD28_WIDTH                  1
#define LCD_WF8B_BPGLCD28(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD28_SHIFT))&LCD_WF8B_BPGLCD28_MASK)
#define LCD_WF8B_BPGLCD29_MASK                   0x40u
#define LCD_WF8B_BPGLCD29_SHIFT                  6
#define LCD_WF8B_BPGLCD29_WIDTH                  1
#define LCD_WF8B_BPGLCD29(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD29_SHIFT))&LCD_WF8B_BPGLCD29_MASK)
#define LCD_WF8B_BPGLCD4_MASK                    0x40u
#define LCD_WF8B_BPGLCD4_SHIFT                   6
#define LCD_WF8B_BPGLCD4_WIDTH                   1
#define LCD_WF8B_BPGLCD4(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD4_SHIFT))&LCD_WF8B_BPGLCD4_MASK)
#define LCD_WF8B_BPGLCD44_MASK                   0x40u
#define LCD_WF8B_BPGLCD44_SHIFT                  6
#define LCD_WF8B_BPGLCD44_WIDTH                  1
#define LCD_WF8B_BPGLCD44(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD44_SHIFT))&LCD_WF8B_BPGLCD44_MASK)
#define LCD_WF8B_BPGLCD30_MASK                   0x40u
#define LCD_WF8B_BPGLCD30_SHIFT                  6
#define LCD_WF8B_BPGLCD30_WIDTH                  1
#define LCD_WF8B_BPGLCD30(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD30_SHIFT))&LCD_WF8B_BPGLCD30_MASK)
#define LCD_WF8B_BPGLCD2_MASK                    0x40u
#define LCD_WF8B_BPGLCD2_SHIFT                   6
#define LCD_WF8B_BPGLCD2_WIDTH                   1
#define LCD_WF8B_BPGLCD2(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD2_SHIFT))&LCD_WF8B_BPGLCD2_MASK)
#define LCD_WF8B_BPGLCD31_MASK                   0x40u
#define LCD_WF8B_BPGLCD31_SHIFT                  6
#define LCD_WF8B_BPGLCD31_WIDTH                  1
#define LCD_WF8B_BPGLCD31(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD31_SHIFT))&LCD_WF8B_BPGLCD31_MASK)
#define LCD_WF8B_BPGLCD43_MASK                   0x40u
#define LCD_WF8B_BPGLCD43_SHIFT                  6
#define LCD_WF8B_BPGLCD43_WIDTH                  1
#define LCD_WF8B_BPGLCD43(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD43_SHIFT))&LCD_WF8B_BPGLCD43_MASK)
#define LCD_WF8B_BPGLCD32_MASK                   0x40u
#define LCD_WF8B_BPGLCD32_SHIFT                  6
#define LCD_WF8B_BPGLCD32_WIDTH                  1
#define LCD_WF8B_BPGLCD32(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD32_SHIFT))&LCD_WF8B_BPGLCD32_MASK)
#define LCD_WF8B_BPGLCD33_MASK                   0x40u
#define LCD_WF8B_BPGLCD33_SHIFT                  6
#define LCD_WF8B_BPGLCD33_WIDTH                  1
#define LCD_WF8B_BPGLCD33(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD33_SHIFT))&LCD_WF8B_BPGLCD33_MASK)
#define LCD_WF8B_BPGLCD42_MASK                   0x40u
#define LCD_WF8B_BPGLCD42_SHIFT                  6
#define LCD_WF8B_BPGLCD42_WIDTH                  1
#define LCD_WF8B_BPGLCD42(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD42_SHIFT))&LCD_WF8B_BPGLCD42_MASK)
#define LCD_WF8B_BPGLCD34_MASK                   0x40u
#define LCD_WF8B_BPGLCD34_SHIFT                  6
#define LCD_WF8B_BPGLCD34_WIDTH                  1
#define LCD_WF8B_BPGLCD34(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD34_SHIFT))&LCD_WF8B_BPGLCD34_MASK)
#define LCD_WF8B_BPGLCD11_MASK                   0x40u
#define LCD_WF8B_BPGLCD11_SHIFT                  6
#define LCD_WF8B_BPGLCD11_WIDTH                  1
#define LCD_WF8B_BPGLCD11(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD11_SHIFT))&LCD_WF8B_BPGLCD11_MASK)
#define LCD_WF8B_BPGLCD35_MASK                   0x40u
#define LCD_WF8B_BPGLCD35_SHIFT                  6
#define LCD_WF8B_BPGLCD35_WIDTH                  1
#define LCD_WF8B_BPGLCD35(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD35_SHIFT))&LCD_WF8B_BPGLCD35_MASK)
#define LCD_WF8B_BPGLCD12_MASK                   0x40u
#define LCD_WF8B_BPGLCD12_SHIFT                  6
#define LCD_WF8B_BPGLCD12_WIDTH                  1
#define LCD_WF8B_BPGLCD12(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD12_SHIFT))&LCD_WF8B_BPGLCD12_MASK)
#define LCD_WF8B_BPGLCD41_MASK                   0x40u
#define LCD_WF8B_BPGLCD41_SHIFT                  6
#define LCD_WF8B_BPGLCD41_WIDTH                  1
#define LCD_WF8B_BPGLCD41(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD41_SHIFT))&LCD_WF8B_BPGLCD41_MASK)
#define LCD_WF8B_BPGLCD36_MASK                   0x40u
#define LCD_WF8B_BPGLCD36_SHIFT                  6
#define LCD_WF8B_BPGLCD36_WIDTH                  1
#define LCD_WF8B_BPGLCD36(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD36_SHIFT))&LCD_WF8B_BPGLCD36_MASK)
#define LCD_WF8B_BPGLCD3_MASK                    0x40u
#define LCD_WF8B_BPGLCD3_SHIFT                   6
#define LCD_WF8B_BPGLCD3_WIDTH                   1
#define LCD_WF8B_BPGLCD3(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD3_SHIFT))&LCD_WF8B_BPGLCD3_MASK)
#define LCD_WF8B_BPGLCD37_MASK                   0x40u
#define LCD_WF8B_BPGLCD37_SHIFT                  6
#define LCD_WF8B_BPGLCD37_WIDTH                  1
#define LCD_WF8B_BPGLCD37(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD37_SHIFT))&LCD_WF8B_BPGLCD37_MASK)
#define LCD_WF8B_BPGLCD40_MASK                   0x40u
#define LCD_WF8B_BPGLCD40_SHIFT                  6
#define LCD_WF8B_BPGLCD40_WIDTH                  1
#define LCD_WF8B_BPGLCD40(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD40_SHIFT))&LCD_WF8B_BPGLCD40_MASK)
#define LCD_WF8B_BPGLCD38_MASK                   0x40u
#define LCD_WF8B_BPGLCD38_SHIFT                  6
#define LCD_WF8B_BPGLCD38_WIDTH                  1
#define LCD_WF8B_BPGLCD38(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD38_SHIFT))&LCD_WF8B_BPGLCD38_MASK)
#define LCD_WF8B_BPGLCD39_MASK                   0x40u
#define LCD_WF8B_BPGLCD39_SHIFT                  6
#define LCD_WF8B_BPGLCD39_WIDTH                  1
#define LCD_WF8B_BPGLCD39(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPGLCD39_SHIFT))&LCD_WF8B_BPGLCD39_MASK)
#define LCD_WF8B_BPHLCD63_MASK                   0x80u
#define LCD_WF8B_BPHLCD63_SHIFT                  7
#define LCD_WF8B_BPHLCD63_WIDTH                  1
#define LCD_WF8B_BPHLCD63(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD63_SHIFT))&LCD_WF8B_BPHLCD63_MASK)
#define LCD_WF8B_BPHLCD62_MASK                   0x80u
#define LCD_WF8B_BPHLCD62_SHIFT                  7
#define LCD_WF8B_BPHLCD62_WIDTH                  1
#define LCD_WF8B_BPHLCD62(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD62_SHIFT))&LCD_WF8B_BPHLCD62_MASK)
#define LCD_WF8B_BPHLCD61_MASK                   0x80u
#define LCD_WF8B_BPHLCD61_SHIFT                  7
#define LCD_WF8B_BPHLCD61_WIDTH                  1
#define LCD_WF8B_BPHLCD61(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD61_SHIFT))&LCD_WF8B_BPHLCD61_MASK)
#define LCD_WF8B_BPHLCD60_MASK                   0x80u
#define LCD_WF8B_BPHLCD60_SHIFT                  7
#define LCD_WF8B_BPHLCD60_WIDTH                  1
#define LCD_WF8B_BPHLCD60(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD60_SHIFT))&LCD_WF8B_BPHLCD60_MASK)
#define LCD_WF8B_BPHLCD59_MASK                   0x80u
#define LCD_WF8B_BPHLCD59_SHIFT                  7
#define LCD_WF8B_BPHLCD59_WIDTH                  1
#define LCD_WF8B_BPHLCD59(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD59_SHIFT))&LCD_WF8B_BPHLCD59_MASK)
#define LCD_WF8B_BPHLCD58_MASK                   0x80u
#define LCD_WF8B_BPHLCD58_SHIFT                  7
#define LCD_WF8B_BPHLCD58_WIDTH                  1
#define LCD_WF8B_BPHLCD58(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD58_SHIFT))&LCD_WF8B_BPHLCD58_MASK)
#define LCD_WF8B_BPHLCD57_MASK                   0x80u
#define LCD_WF8B_BPHLCD57_SHIFT                  7
#define LCD_WF8B_BPHLCD57_WIDTH                  1
#define LCD_WF8B_BPHLCD57(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD57_SHIFT))&LCD_WF8B_BPHLCD57_MASK)
#define LCD_WF8B_BPHLCD0_MASK                    0x80u
#define LCD_WF8B_BPHLCD0_SHIFT                   7
#define LCD_WF8B_BPHLCD0_WIDTH                   1
#define LCD_WF8B_BPHLCD0(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD0_SHIFT))&LCD_WF8B_BPHLCD0_MASK)
#define LCD_WF8B_BPHLCD56_MASK                   0x80u
#define LCD_WF8B_BPHLCD56_SHIFT                  7
#define LCD_WF8B_BPHLCD56_WIDTH                  1
#define LCD_WF8B_BPHLCD56(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD56_SHIFT))&LCD_WF8B_BPHLCD56_MASK)
#define LCD_WF8B_BPHLCD55_MASK                   0x80u
#define LCD_WF8B_BPHLCD55_SHIFT                  7
#define LCD_WF8B_BPHLCD55_WIDTH                  1
#define LCD_WF8B_BPHLCD55(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD55_SHIFT))&LCD_WF8B_BPHLCD55_MASK)
#define LCD_WF8B_BPHLCD54_MASK                   0x80u
#define LCD_WF8B_BPHLCD54_SHIFT                  7
#define LCD_WF8B_BPHLCD54_WIDTH                  1
#define LCD_WF8B_BPHLCD54(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD54_SHIFT))&LCD_WF8B_BPHLCD54_MASK)
#define LCD_WF8B_BPHLCD53_MASK                   0x80u
#define LCD_WF8B_BPHLCD53_SHIFT                  7
#define LCD_WF8B_BPHLCD53_WIDTH                  1
#define LCD_WF8B_BPHLCD53(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD53_SHIFT))&LCD_WF8B_BPHLCD53_MASK)
#define LCD_WF8B_BPHLCD52_MASK                   0x80u
#define LCD_WF8B_BPHLCD52_SHIFT                  7
#define LCD_WF8B_BPHLCD52_WIDTH                  1
#define LCD_WF8B_BPHLCD52(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD52_SHIFT))&LCD_WF8B_BPHLCD52_MASK)
#define LCD_WF8B_BPHLCD51_MASK                   0x80u
#define LCD_WF8B_BPHLCD51_SHIFT                  7
#define LCD_WF8B_BPHLCD51_WIDTH                  1
#define LCD_WF8B_BPHLCD51(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD51_SHIFT))&LCD_WF8B_BPHLCD51_MASK)
#define LCD_WF8B_BPHLCD50_MASK                   0x80u
#define LCD_WF8B_BPHLCD50_SHIFT                  7
#define LCD_WF8B_BPHLCD50_WIDTH                  1
#define LCD_WF8B_BPHLCD50(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD50_SHIFT))&LCD_WF8B_BPHLCD50_MASK)
#define LCD_WF8B_BPHLCD1_MASK                    0x80u
#define LCD_WF8B_BPHLCD1_SHIFT                   7
#define LCD_WF8B_BPHLCD1_WIDTH                   1
#define LCD_WF8B_BPHLCD1(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD1_SHIFT))&LCD_WF8B_BPHLCD1_MASK)
#define LCD_WF8B_BPHLCD49_MASK                   0x80u
#define LCD_WF8B_BPHLCD49_SHIFT                  7
#define LCD_WF8B_BPHLCD49_WIDTH                  1
#define LCD_WF8B_BPHLCD49(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD49_SHIFT))&LCD_WF8B_BPHLCD49_MASK)
#define LCD_WF8B_BPHLCD48_MASK                   0x80u
#define LCD_WF8B_BPHLCD48_SHIFT                  7
#define LCD_WF8B_BPHLCD48_WIDTH                  1
#define LCD_WF8B_BPHLCD48(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD48_SHIFT))&LCD_WF8B_BPHLCD48_MASK)
#define LCD_WF8B_BPHLCD47_MASK                   0x80u
#define LCD_WF8B_BPHLCD47_SHIFT                  7
#define LCD_WF8B_BPHLCD47_WIDTH                  1
#define LCD_WF8B_BPHLCD47(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD47_SHIFT))&LCD_WF8B_BPHLCD47_MASK)
#define LCD_WF8B_BPHLCD46_MASK                   0x80u
#define LCD_WF8B_BPHLCD46_SHIFT                  7
#define LCD_WF8B_BPHLCD46_WIDTH                  1
#define LCD_WF8B_BPHLCD46(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD46_SHIFT))&LCD_WF8B_BPHLCD46_MASK)
#define LCD_WF8B_BPHLCD45_MASK                   0x80u
#define LCD_WF8B_BPHLCD45_SHIFT                  7
#define LCD_WF8B_BPHLCD45_WIDTH                  1
#define LCD_WF8B_BPHLCD45(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD45_SHIFT))&LCD_WF8B_BPHLCD45_MASK)
#define LCD_WF8B_BPHLCD44_MASK                   0x80u
#define LCD_WF8B_BPHLCD44_SHIFT                  7
#define LCD_WF8B_BPHLCD44_WIDTH                  1
#define LCD_WF8B_BPHLCD44(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD44_SHIFT))&LCD_WF8B_BPHLCD44_MASK)
#define LCD_WF8B_BPHLCD43_MASK                   0x80u
#define LCD_WF8B_BPHLCD43_SHIFT                  7
#define LCD_WF8B_BPHLCD43_WIDTH                  1
#define LCD_WF8B_BPHLCD43(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD43_SHIFT))&LCD_WF8B_BPHLCD43_MASK)
#define LCD_WF8B_BPHLCD2_MASK                    0x80u
#define LCD_WF8B_BPHLCD2_SHIFT                   7
#define LCD_WF8B_BPHLCD2_WIDTH                   1
#define LCD_WF8B_BPHLCD2(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD2_SHIFT))&LCD_WF8B_BPHLCD2_MASK)
#define LCD_WF8B_BPHLCD42_MASK                   0x80u
#define LCD_WF8B_BPHLCD42_SHIFT                  7
#define LCD_WF8B_BPHLCD42_WIDTH                  1
#define LCD_WF8B_BPHLCD42(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD42_SHIFT))&LCD_WF8B_BPHLCD42_MASK)
#define LCD_WF8B_BPHLCD41_MASK                   0x80u
#define LCD_WF8B_BPHLCD41_SHIFT                  7
#define LCD_WF8B_BPHLCD41_WIDTH                  1
#define LCD_WF8B_BPHLCD41(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD41_SHIFT))&LCD_WF8B_BPHLCD41_MASK)
#define LCD_WF8B_BPHLCD40_MASK                   0x80u
#define LCD_WF8B_BPHLCD40_SHIFT                  7
#define LCD_WF8B_BPHLCD40_WIDTH                  1
#define LCD_WF8B_BPHLCD40(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD40_SHIFT))&LCD_WF8B_BPHLCD40_MASK)
#define LCD_WF8B_BPHLCD39_MASK                   0x80u
#define LCD_WF8B_BPHLCD39_SHIFT                  7
#define LCD_WF8B_BPHLCD39_WIDTH                  1
#define LCD_WF8B_BPHLCD39(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD39_SHIFT))&LCD_WF8B_BPHLCD39_MASK)
#define LCD_WF8B_BPHLCD38_MASK                   0x80u
#define LCD_WF8B_BPHLCD38_SHIFT                  7
#define LCD_WF8B_BPHLCD38_WIDTH                  1
#define LCD_WF8B_BPHLCD38(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD38_SHIFT))&LCD_WF8B_BPHLCD38_MASK)
#define LCD_WF8B_BPHLCD37_MASK                   0x80u
#define LCD_WF8B_BPHLCD37_SHIFT                  7
#define LCD_WF8B_BPHLCD37_WIDTH                  1
#define LCD_WF8B_BPHLCD37(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD37_SHIFT))&LCD_WF8B_BPHLCD37_MASK)
#define LCD_WF8B_BPHLCD36_MASK                   0x80u
#define LCD_WF8B_BPHLCD36_SHIFT                  7
#define LCD_WF8B_BPHLCD36_WIDTH                  1
#define LCD_WF8B_BPHLCD36(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD36_SHIFT))&LCD_WF8B_BPHLCD36_MASK)
#define LCD_WF8B_BPHLCD3_MASK                    0x80u
#define LCD_WF8B_BPHLCD3_SHIFT                   7
#define LCD_WF8B_BPHLCD3_WIDTH                   1
#define LCD_WF8B_BPHLCD3(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD3_SHIFT))&LCD_WF8B_BPHLCD3_MASK)
#define LCD_WF8B_BPHLCD35_MASK                   0x80u
#define LCD_WF8B_BPHLCD35_SHIFT                  7
#define LCD_WF8B_BPHLCD35_WIDTH                  1
#define LCD_WF8B_BPHLCD35(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD35_SHIFT))&LCD_WF8B_BPHLCD35_MASK)
#define LCD_WF8B_BPHLCD34_MASK                   0x80u
#define LCD_WF8B_BPHLCD34_SHIFT                  7
#define LCD_WF8B_BPHLCD34_WIDTH                  1
#define LCD_WF8B_BPHLCD34(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD34_SHIFT))&LCD_WF8B_BPHLCD34_MASK)
#define LCD_WF8B_BPHLCD33_MASK                   0x80u
#define LCD_WF8B_BPHLCD33_SHIFT                  7
#define LCD_WF8B_BPHLCD33_WIDTH                  1
#define LCD_WF8B_BPHLCD33(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD33_SHIFT))&LCD_WF8B_BPHLCD33_MASK)
#define LCD_WF8B_BPHLCD32_MASK                   0x80u
#define LCD_WF8B_BPHLCD32_SHIFT                  7
#define LCD_WF8B_BPHLCD32_WIDTH                  1
#define LCD_WF8B_BPHLCD32(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD32_SHIFT))&LCD_WF8B_BPHLCD32_MASK)
#define LCD_WF8B_BPHLCD31_MASK                   0x80u
#define LCD_WF8B_BPHLCD31_SHIFT                  7
#define LCD_WF8B_BPHLCD31_WIDTH                  1
#define LCD_WF8B_BPHLCD31(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD31_SHIFT))&LCD_WF8B_BPHLCD31_MASK)
#define LCD_WF8B_BPHLCD30_MASK                   0x80u
#define LCD_WF8B_BPHLCD30_SHIFT                  7
#define LCD_WF8B_BPHLCD30_WIDTH                  1
#define LCD_WF8B_BPHLCD30(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD30_SHIFT))&LCD_WF8B_BPHLCD30_MASK)
#define LCD_WF8B_BPHLCD29_MASK                   0x80u
#define LCD_WF8B_BPHLCD29_SHIFT                  7
#define LCD_WF8B_BPHLCD29_WIDTH                  1
#define LCD_WF8B_BPHLCD29(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD29_SHIFT))&LCD_WF8B_BPHLCD29_MASK)
#define LCD_WF8B_BPHLCD4_MASK                    0x80u
#define LCD_WF8B_BPHLCD4_SHIFT                   7
#define LCD_WF8B_BPHLCD4_WIDTH                   1
#define LCD_WF8B_BPHLCD4(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD4_SHIFT))&LCD_WF8B_BPHLCD4_MASK)
#define LCD_WF8B_BPHLCD28_MASK                   0x80u
#define LCD_WF8B_BPHLCD28_SHIFT                  7
#define LCD_WF8B_BPHLCD28_WIDTH                  1
#define LCD_WF8B_BPHLCD28(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD28_SHIFT))&LCD_WF8B_BPHLCD28_MASK)
#define LCD_WF8B_BPHLCD27_MASK                   0x80u
#define LCD_WF8B_BPHLCD27_SHIFT                  7
#define LCD_WF8B_BPHLCD27_WIDTH                  1
#define LCD_WF8B_BPHLCD27(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPHLCD27_SHIFT))&LCD_WF8B_BPHLCD27_MASK)
#define LCD_WF8B_BPHLCD26_MASK                   0x80u
#define LCD_WF8B_BPHLCD26_SHIFT                  7
#define LCD_WF8B_BPHLCD26_WIDTH                  1
