RT-Thread/rt-thread/bsp/freescale/platform/devices/MK51D10/include/MK51D10.h
/* NV - Peripheral instance base addresses */
/** Peripheral FTFL_FlashConfig base address */
#define FTFL_FlashConfig_BASE                    (0x400u)
/** Peripheral FTFL_FlashConfig base pointer */
#define FTFL_FlashConfig                         ((NV_Type *)FTFL_FlashConfig_BASE)
#define FTFL_FlashConfig_BASE_PTR                (FTFL_FlashConfig)
/** Array initializer of NV peripheral base addresses */
#define NV_BASE_ADDRS                            { FTFL_FlashConfig_BASE }
/** Array initializer of NV peripheral base pointers */
#define NV_BASE_PTRS                             { FTFL_FlashConfig }

/* ----------------------------------------------------------------------------
   -- NV - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NV_Register_Accessor_Macros NV - Register accessor macros
 * @{
 */


/* NV - Register instance definitions */
/* FTFL_FlashConfig */
#define NV_BACKKEY3                              NV_BACKKEY3_REG(FTFL_FlashConfig)
#define NV_BACKKEY2                              NV_BACKKEY2_REG(FTFL_FlashConfig)
#define NV_BACKKEY1                              NV_BACKKEY1_REG(FTFL_FlashConfig)
#define NV_BACKKEY0                              NV_BACKKEY0_REG(FTFL_FlashConfig)
#define NV_BACKKEY7                              NV_BACKKEY7_REG(FTFL_FlashConfig)
#define NV_BACKKEY6                              NV_BACKKEY6_REG(FTFL_FlashConfig)
#define NV_BACKKEY5                              NV_BACKKEY5_REG(FTFL_FlashConfig)
#define NV_BACKKEY4                              NV_BACKKEY4_REG(FTFL_FlashConfig)
#define NV_FPROT3                                NV_FPROT3_REG(FTFL_FlashConfig)
#define NV_FPROT2                                NV_FPROT2_REG(FTFL_FlashConfig)
#define NV_FPROT1                                NV_FPROT1_REG(FTFL_FlashConfig)
#define NV_FPROT0                                NV_FPROT0_REG(FTFL_FlashConfig)
#define NV_FSEC                                  NV_FSEC_REG(FTFL_FlashConfig)
#define NV_FOPT                                  NV_FOPT_REG(FTFL_FlashConfig)
#define NV_FEPROT                                NV_FEPROT_REG(FTFL_FlashConfig)
#define NV_FDPROT                                NV_FDPROT_REG(FTFL_FlashConfig)

/*!
 * @}
 */ /* end of group NV_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group NV_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- OPAMP Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OPAMP_Peripheral_Access_Layer OPAMP Peripheral Access Layer
 * @{
 */

/** OPAMP - Register Layout Typedef */
typedef struct {
  __IO uint8_t C0;                                 /**< Control Register 0, offset: 0x0 */
  __IO uint8_t C1;                                 /**< Control Register 1, offset: 0x1 */
  __IO uint8_t C2;                                 /**< Control Register 2, offset: 0x2 */
} OPAMP_Type, *OPAMP_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- OPAMP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OPAMP_Register_Accessor_Macros OPAMP - Register accessor macros
 * @{
 */


/* OPAMP - Register accessors */
#define OPAMP_C0_REG(base)                       ((base)->C0)
#define OPAMP_C1_REG(base)                       ((base)->C1)
#define OPAMP_C2_REG(base)                       ((base)->C2)

/*!
 * @}
 */ /* end of group OPAMP_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- OPAMP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OPAMP_Register_Masks OPAMP Register Masks
 * @{
 */

/* C0 Bit Fields */
#define OPAMP_C0_MODE_MASK                       0x3u
#define OPAMP_C0_MODE_SHIFT                      0
#define OPAMP_C0_MODE_WIDTH                      2
#define OPAMP_C0_MODE(x)                         (((uint8_t)(((uint8_t)(x))<<OPAMP_C0_MODE_SHIFT))&OPAMP_C0_MODE_MASK)
#define OPAMP_C0_LPEN_MASK                       0x40u
#define OPAMP_C0_LPEN_SHIFT                      6
#define OPAMP_C0_LPEN_WIDTH                      1
#define OPAMP_C0_LPEN(x)                         (((uint8_t)(((uint8_t)(x))<<OPAMP_C0_LPEN_SHIFT))&OPAMP_C0_LPEN_MASK)
#define OPAMP_C0_EN_MASK                         0x80u
#define OPAMP_C0_EN_SHIFT                        7
#define OPAMP_C0_EN_WIDTH                        1
#define OPAMP_C0_EN(x)                           (((uint8_t)(((uint8_t)(x))<<OPAMP_C0_EN_SHIFT))&OPAMP_C0_EN_MASK)
/* C1 Bit Fields */
#define OPAMP_C1_AMPRI_MASK                      0x3u
#define OPAMP_C1_AMPRI_SHIFT                     0
#define OPAMP_C1_AMPRI_WIDTH                     2
#define OPAMP_C1_AMPRI(x)                        (((uint8_t)(((uint8_t)(x))<<OPAMP_C1_AMPRI_SHIFT))&OPAMP_C1_AMPRI_MASK)
#define OPAMP_C1_AMPRF_MASK                      0x1Cu
#define OPAMP_C1_AMPRF_SHIFT                     2
#define OPAMP_C1_AMPRF_WIDTH                     3
#define OPAMP_C1_AMPRF(x)                        (((uint8_t)(((uint8_t)(x))<<OPAMP_C1_AMPRF_SHIFT))&OPAMP_C1_AMPRF_MASK)
/* C2 Bit Fields */
#define OPAMP_C2_AMPNSEL_MASK                    0x7u
#define OPAMP_C2_AMPNSEL_SHIFT                   0
#define OPAMP_C2_AMPNSEL_WIDTH                   3
#define OPAMP_C2_AMPNSEL(x)                      (((uint8_t)(((uint8_t)(x))<<OPAMP_C2_AMPNSEL_SHIFT))&OPAMP_C2_AMPNSEL_MASK)
#define OPAMP_C2_AMPPSEL_MASK                    0x70u
#define OPAMP_C2_AMPPSEL_SHIFT                   4
#define OPAMP_C2_AMPPSEL_WIDTH                   3
#define OPAMP_C2_AMPPSEL(x)                      (((uint8_t)(((uint8_t)(x))<<OPAMP_C2_AMPPSEL_SHIFT))&OPAMP_C2_AMPPSEL_MASK)

/*!
 * @}
 */ /* end of group OPAMP_Register_Masks */


/* OPAMP - Peripheral instance base addresses */
/** Peripheral OPAMP0 base address */
#define OPAMP0_BASE                              (0x400F5000u)
/** Peripheral OPAMP0 base pointer */
#define OPAMP0                                   ((OPAMP_Type *)OPAMP0_BASE)
#define OPAMP0_BASE_PTR                          (OPAMP0)
/** Peripheral OPAMP1 base address */
#define OPAMP1_BASE                              (0x400F5800u)
/** Peripheral OPAMP1 base pointer */
#define OPAMP1                                   ((OPAMP_Type *)OPAMP1_BASE)
#define OPAMP1_BASE_PTR                          (OPAMP1)
/** Array initializer of OPAMP peripheral base addresses */
#define OPAMP_BASE_ADDRS                         { OPAMP0_BASE, OPAMP1_BASE }
/** Array initializer of OPAMP peripheral base pointers */
#define OPAMP_BASE_PTRS                          { OPAMP0, OPAMP1 }

/* ----------------------------------------------------------------------------
   -- OPAMP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OPAMP_Register_Accessor_Macros OPAMP - Register accessor macros
 * @{
 */


/* OPAMP - Register instance definitions */
/* OPAMP0 */
#define OPAMP0_C0                                OPAMP_C0_REG(OPAMP0)
#define OPAMP0_C1                                OPAMP_C1_REG(OPAMP0)
#define OPAMP0_C2                                OPAMP_C2_REG(OPAMP0)
/* OPAMP1 */
#define OPAMP1_C0                                OPAMP_C0_REG(OPAMP1)
#define OPAMP1_C1                                OPAMP_C1_REG(OPAMP1)
#define OPAMP1_C2                                OPAMP_C2_REG(OPAMP1)

/*!
 * @}
 */ /* end of group OPAMP_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group OPAMP_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- OSC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSC_Peripheral_Access_Layer OSC Peripheral Access Layer
 * @{
 */

/** OSC - Register Layout Typedef */
typedef struct {
  __IO uint8_t CR;                                 /**< OSC Control Register, offset: 0x0 */
} OSC_Type, *OSC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- OSC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSC_Register_Accessor_Macros OSC - Register accessor macros
 * @{
 */


/* OSC - Register accessors */
#define OSC_CR_REG(base)                         ((base)->CR)

/*!
 * @}
 */ /* end of group OSC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- OSC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSC_Register_Masks OSC Register Masks
 * @{
 */

/* CR Bit Fields */
#define OSC_CR_SC16P_MASK                        0x1u
#define OSC_CR_SC16P_SHIFT                       0
#define OSC_CR_SC16P_WIDTH                       1
#define OSC_CR_SC16P(x)                          (((uint8_t)(((uint8_t)(x))<<OSC_CR_SC16P_SHIFT))&OSC_CR_SC16P_MASK)
#define OSC_CR_SC8P_MASK                         0x2u
#define OSC_CR_SC8P_SHIFT                        1
#define OSC_CR_SC8P_WIDTH                        1
#define OSC_CR_SC8P(x)                           (((uint8_t)(((uint8_t)(x))<<OSC_CR_SC8P_SHIFT))&OSC_CR_SC8P_MASK)
#define OSC_CR_SC4P_MASK                         0x4u
#define OSC_CR_SC4P_SHIFT                        2
#define OSC_CR_SC4P_WIDTH                        1
#define OSC_CR_SC4P(x)                           (((uint8_t)(((uint8_t)(x))<<OSC_CR_SC4P_SHIFT))&OSC_CR_SC4P_MASK)
#define OSC_CR_SC2P_MASK                         0x8u
#define OSC_CR_SC2P_SHIFT                        3
#define OSC_CR_SC2P_WIDTH                        1
#define OSC_CR_SC2P(x)                           (((uint8_t)(((uint8_t)(x))<<OSC_CR_SC2P_SHIFT))&OSC_CR_SC2P_MASK)
#define OSC_CR_EREFSTEN_MASK                     0x20u
#define OSC_CR_EREFSTEN_SHIFT                    5
#define OSC_CR_EREFSTEN_WIDTH                    1
#define OSC_CR_EREFSTEN(x)                       (((uint8_t)(((uint8_t)(x))<<OSC_CR_EREFSTEN_SHIFT))&OSC_CR_EREFSTEN_MASK)
#define OSC_CR_ERCLKEN_MASK                      0x80u
#define OSC_CR_ERCLKEN_SHIFT                     7
#define OSC_CR_ERCLKEN_WIDTH                     1
#define OSC_CR_ERCLKEN(x)                        (((uint8_t)(((uint8_t)(x))<<OSC_CR_ERCLKEN_SHIFT))&OSC_CR_ERCLKEN_MASK)

/*!
 * @}
 */ /* end of group OSC_Register_Masks */


